{
  "Synopsis": "Exports Sheets from Excel Workbooks to CSV files.",
  "Description": "This command provides a convenient way to run Import-Excel @ImportParameters \\| Select-Object @selectParameters \\| export-Csv @ ExportParameters It can take the parameters -AsText , as used in Import-Excel, )Properties & -ExcludeProperties as used in Select-Object and -Append, -Delimiter and -Encoding as used in Export-CSV",
  "Parameters": [
    {
      "Name": null,
      "Type": null,
      "Description": "",
      "Required": false,
      "Position": 0,
      "Aliases": null,
      "DefaultValue": null,
      "Globbing": false,
      "PipelineInput": null,
      "variableLength": false
    }
  ],
  "Notes": [
    ""
  ],
  "CommandType": "Function",
  "Component": [
    null
  ],
  "Inputs": [
    "None"
  ],
  "Outputs": [
    "System.Object"
  ],
  "Links": [
    null
  ],
  "Examples": [
    {
      "Title": "Example 1",
      "Markdown": "",
      "Code": "PS C:\\> ConvertFrom-ExcelSheet Path .\\__tests__\\First10Races.xlsx -OutputPath .. -AsText GridPosition,date\r\nFirst10Races.xlsx contains information about Motor races. The race date and grid (starting) position are stored with custom formats. The command specifies the path to the file, and the directory to create the output file, and specifies that the columns \"GridPosition\" and \"Date\" should be treated as text to preserve their formatting"
    },
    {
      "Title": "Example 2",
      "Markdown": "",
      "Code": "PS C:\\> ConvertFrom-ExcelSheet Path .\\__tests__\\First10Races.xlsx -OutputPath .. -AsText \"GridPosition\" -Property driver, @{n=\"date\"; e={[datetime]::FromOADate($_.Date).tostring(\"#MM/dd/yyyy#\")}} , FinishPosition, GridPosition\r\nThis uses the same file as example 1. Because the race date has a custom format, it imports as a number, The requirement is to create a CSV file with the Driver, a specially formatted Date, FinishPostion and GridPostion (keeping its custom formatting). The command specifies the path to the file, and the directory to create the output file, specifies that the column \"GridPosition\" should be treated as text instead of a number, and the output properties should be Driver, a calculated \"date\" field, FinishPosition and GridPsition. FromOADate converts the dates used by Excel (Days since Jan 1 1900) to a datetime object."
    }
  ]
}