{
  "Synopsis": "Combines data on all the sheets in an Excel worksheet onto a single sheet.",
  "Description": "Join-Worksheet can work in two main ways, either Combining data which has the same layout from many pages into one, or Combining pages which have nothing in common. In the former case the header row is copied from the first sheet and, by default, each row of data is labelled with the name of the sheet it came from.\r\n\r\n\r\nIn the latter case -NoHeader is specified, and each copied block can have the sheet it came from placed above it as a title.",
  "Parameters": [
    {
      "Name": null,
      "Type": null,
      "Description": "",
      "Required": false,
      "Position": 0,
      "Aliases": null,
      "DefaultValue": null,
      "Globbing": false,
      "PipelineInput": null,
      "variableLength": false
    }
  ],
  "Notes": [
    ""
  ],
  "CommandType": "Function",
  "Component": [
    null
  ],
  "Inputs": [
    null
  ],
  "Outputs": [
    null
  ],
  "Links": [
    null
  ],
  "Examples": [
    {
      "Title": "EXAMPLE 1",
      "Markdown": "",
      "Code": "PS\\> foreach ($computerName in @('Server1', 'Server2', 'Server3', 'Server4')) {\r\n    Get-Service -ComputerName $computerName |\r\n        Select-Object -Property Status, Name, DisplayName, StartType |\r\n            Export-Excel -Path .\\test.xlsx -WorkSheetname $computerName -AutoSize\r\n}\r\nPS\\> $ptDef = New-PivotTableDefinition -PivotTableName \"Pivot1\" -SourceWorkSheet \"Combined\" -PivotRows \"Status\" -PivotFilter \"MachineName\" -PivotData @{Status='Count'} -IncludePivotChart -ChartType BarClustered3D\r\nPS\\> Join-Worksheet -Path .\\test.xlsx -WorkSheetName combined -FromLabel \"MachineName\" -HideSource-AutoSize -FreezeTopRow -BoldTopRow -PivotTableDefinition $pt -Show\r\nThe foreach command gets a list of services running on four servers and exports each list to its own page in Test.xlsx. And $PtDef=... creates a definition for a PivotTable.\r\n\r\nThe Join-Worksheet command uses the same file and merges the results into a sheet named \"Combined\". It sets a column header of \"Machinename\", this column will contain the name of the sheet the data was copied from; after copying the data to the sheet \"Combined\", the other sheets will be hidden. Join-Worksheet finishes by calling Export-Excel to AutoSize cells, freeze the top row and make it bold and add thePivotTable."
    },
    {
      "Title": "EXAMPLE 2",
      "Markdown": "",
      "Code": "PS\\> Get-CimInstance -ClassName win32_logicaldisk |\r\n        Select-Object -Property DeviceId,VolumeName, Size,Freespace |\r\n            Export-Excel -Path \"$env:computerName.xlsx\" -WorkSheetname Volumes -NumberFormat \"0,000\"\r\nPS\\> Get-NetAdapter| Select-Object Name,InterfaceDescription,MacAddress,LinkSpeed |\r\n          Export-Excel -Path \"$env:COMPUTERNAME.xlsx\" -WorkSheetname NetAdapter\r\nPS\\> Join-Worksheet -Path \"$env:COMPUTERNAME.xlsx\"-WorkSheetName Summary -Title \"Summary\" -TitleBold -TitleSize 22 -NoHeader -LabelBlocks -AutoSize -HideSource -show\r\nThe first two commands get logical-disk and network-card information; each type is exported to its own sheet in a workbook.\r\n\r\nThe Join-Worksheet command copies both onto a page named \"Summary\".Because the data is dissimilar, -NoHeader is specified, ensuring the whole of each page is copied. Specifying -LabelBlocks causes each sheet's name to become a title on the summary page above the copied data. The source data is hidden, a title is added in 22 point boldface and the columns are sized to fit the data."
    }
  ]
}