{
  "Synopsis": "Create an installation access token for an app",
  "Description": "Creates an installation access token that enables a GitHub App to make authenticated API requests for the app's installation on an\norganization or individual account. Installation tokens expire one hour from the time you create them. Using an expired token produces a\nstatus code of `401 - Unauthorized`, and requires creating a new installation token. By default the installation token has access to all\nrepositories that the installation can access.\n\nOptionally, you can use the `repositories` or `repository_ids` body parameters to specify individual repositories that the installation access\ntoken can access. If you don't use `repositories` or `repository_ids` to grant access to specific repositories, the installation access token\nwill have access to all repositories that the installation was granted access to. The installation access token cannot be granted access to\nrepositories that the installation was not granted access to. Up to 500 repositories can be listed in this manner.\n\nOptionally, use the `permissions` body parameter to specify the permissions that the installation access token should have. If `permissions`\nis not specified, the installation access token will have all of the permissions that were granted to the app. The installation access token\ncannot be granted permissions that the app was not granted.\n\nWhen using the repository or permission parameters to reduce the access of the token, the complexity of the token is increased due to both the\nnumber of permissions in the request and the number of repositories the token will have access to. If the complexity is too large, the token\nwill fail to be issued. If this occurs, the error message will indicate the maximum number of repositories that should be requested. For the\naverage application requesting 8 permissions, this limit is around 5000 repositories. With fewer permissions requested, more repositories are\nsupported.\n\nYou must use a [JWT](https://docs.github.com/apps/building-github-apps/authenticating-with-github-apps/#authenticating-as-a-github-app)\nto access this endpoint.",
  "Parameters": [
    {
      "Name": null,
      "Type": null,
      "Description": "",
      "Required": false,
      "Position": 0,
      "Aliases": null,
      "DefaultValue": null,
      "Globbing": false,
      "PipelineInput": null,
      "variableLength": false
    }
  ],
  "Notes": [
    "[Create an installation access token for an app](https://docs.github.com/rest/apps/apps#create-an-installation-access-token-for-an-app)"
  ],
  "CommandType": "Filter",
  "Component": [
    null
  ],
  "Inputs": [
    null
  ],
  "Outputs": [
    null
  ],
  "Links": [],
  "Examples": [
    {
      "Title": "EXAMPLE 1",
      "Markdown": "",
      "Code": "New-GitHubAppInstallationAccessToken -InstallationID 12345678\r\nCreates an installation access token for the installation with the ID `12345678`."
    },
    {
      "Title": "EXAMPLE 2",
      "Markdown": "",
      "Code": "Connect-GitHub -ClientID $ClientID -PrivateKey $PrivateKey\r\nGet-GitHubAppInstallation | New-GitHubAppInstallationAccessToken\r\nGets the GitHub App installations and creates an installation access token for each installation."
    }
  ]
}